JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
/* NuttX port: the prologue below came from a wrapper translation unit
 * at wifi/hal_port/vendor_sources/rw_msg_tx.c, which existed only to include this
 * file.  The build lists this file directly now.
 */
/* Wi-Fi-only translation unit: establish Armino's local build contract. */
#include <bk_prelude.h>

// Copyright 2020-2021 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <common/bk_include.h>
#include <os/mem.h>
#include <os/str.h>
#include <common/bk_kernel_err.h>
#include "bk_list.h"
#include "fhost_msg.h"
#include "rw_msg_tx.h"
#include "bk7258_scan_diag.h"
#include "rw_ieee80211.h"
#include "bk_rw.h"
#include "common.h"
#include "driver.h"
//#include "mac_frame.h"
#include "bk_wifi_types.h"
#include "signal.h"
#include "rw_ieee80211.h"
#include "rwnx_params.h"
#include "rwnx_defs.h"
#include "bk_wifi.h"
#if CONFIG_P2P
#include "wifi_v2.h"
#endif
#include "rwnx_misc.h"

#include "rwnx_err.h"
#include "rwnx_defs.h"
#include "bk_wifi_private.h"
//#include "reg_riu.h"
//#include "bk_wifi_prop_private.h"
#include "rwm_proto.h"
#include "modules/pm.h"

#if (CONFIG_FULLY_HOSTED || CONFIG_SEMI_HOSTED)
#ifndef PP_HTONS
#define PP_HTONS(x) ((((x) & 0x00ffUL) << 8) | (((x) & 0xff00UL) >> 8))
#endif
#ifndef ENOMEM
#define ENOMEM 12
#endif
#endif

__INLINE int phy_freq_to_channel(uint8_t band, uint16_t freq)
{
	if ((band == PHY_BAND_2G4) && (freq >= 2412) && (freq <= 2484)) {
		if (freq == 2484)
			return 14;
		else
			return (freq - 2407) / 5;
	} else if ((band == PHY_BAND_5G) && (freq >= 5005) && (freq <= 5825))
		return (freq - PHY_FREQ_5G) / 5;

	return 0;
}

extern int bmsg_ioctl_sender(void *arg);
extern int bmsg_software_para_ioctl_sender(void *arg);
extern int bmsg_hardware_para_ioctl_sender(void *arg);
void phy_get_channel(struct phy_channel_info *info, uint8_t index);
extern bool g_wifi_enable_flag;

int rw_msg_send(const void *msg_params, int reqcfm, uint16_t reqid, void *cfm)
{
	int ret;
	struct ke_msg *msg = ke_param2msg(msg_params);
	MSG_SND_NODE_PTR tx_msg = 0;
	int err = BK_OK;

	GLOBAL_INT_DECLARATION();

	if (g_wifi_enable_flag == false) {
		ke_msg_free(msg);
		RWNX_LOGI("%s Wi-Fi is NOT enable, please enable Wi-Fi first\n", __FUNCTION__);
		err = BK_ERR_WIFI_NOT_INIT;
		goto failed_or_timeout;
	}

	// Need wait cfm from full mac
	if (reqcfm) {
		tx_msg = os_malloc(sizeof(MSG_SND_NODE_ST));
		if (!tx_msg)
			return BK_ERR_NO_MEM;

		tx_msg->msg = msg;
		tx_msg->reqid = reqid;
		tx_msg->cfm = cfm;

		ret = rtos_init_semaphore(&tx_msg->semaphore, 1);
		BK_ASSERT(0 == ret); /* ASSERT VERIFIED */

		GLOBAL_INT_DISABLE();
		co_list_push_back(&rw_msg_tx_head, &tx_msg->hdr);
		GLOBAL_INT_RESTORE();

	}

	///wakeup mac but do not config pwr bit
	///in the future, if the msg doesn't need to wakeup mac, can use bmsg_software_para_ioctl_sender()
	if ((ME_TRAFFIC_IND_REQ == msg->id) ||
		(ME_GET_BSS_INFO_REQ == msg->id) ||
		(MM_SET_LISTEN_INTERVAL_REQ == msg->id) ||
		(MM_SET_BCN_LOSS_INT_REQ == msg->id) ||
		(MM_SET_PSDEBUG_INTERVAL_REQ == msg->id) ||
		(ME_STA_ARP_UPDATE_IND == msg->id) ||
		(MM_SET_ARP_TX_RATE_REQ == msg->id)) {
		ret = bmsg_hardware_para_ioctl_sender((void *)msg_params);
	} else {
		ret = bmsg_ioctl_sender((void *)msg_params);
	}
	if (kNoErr != ret) {
		RWNX_LOGD("%s failed send %d\n", __FUNCTION__, msg->id);
		os_free((void *)msg_params);
		err = RWNX_ERR_IOCTL_SEND;
		goto failed_or_timeout;
	} else if (reqcfm) {
		ret = rtos_get_semaphore(&tx_msg->semaphore, 5 * MICROSECONDS);
			if (0 != ret) {
			/* Timeout already maps to RWNX_ERR_TIMEOUT below; a hard panic
			 * here also wedges the ke task mid-request during bring-up
			 * (observed once with the functional clock finally running and
			 * hal_machw_reset's park loop stalling), so downgrade to the
			 * error return the surrounding code already handles. */
			RWNX_LOGE("%s timeout for %d\n", __FUNCTION__, reqid);
				err = RWNX_ERR_TIMEOUT;

			goto failed_or_timeout;
		}

		ret = rtos_deinit_semaphore(&tx_msg->semaphore);
		BK_ASSERT(0 == ret); /* ASSERT VERIFIED */

		os_free(tx_msg);
	}

	return BK_OK;

failed_or_timeout:
	if (tx_msg) {
		/* The confirmation worker and timeout path share ownership through
		 * rw_msg_tx_head.  Do not free a node RX already extracted until RX
		 * has completed its locked CFM copy and semaphore post. */
		GLOBAL_INT_DISABLE();
		if (co_list_find(&rw_msg_tx_head, &tx_msg->hdr))
			co_list_extract(&rw_msg_tx_head, &tx_msg->hdr);
		GLOBAL_INT_RESTORE();

		ret = rtos_deinit_semaphore(&tx_msg->semaphore);
		BK_ASSERT(0 == ret); /* ASSERT VERIFIED */
		os_free(tx_msg);
	}

	return err;
}

int rw_msg_send_reset(void)
{
	void *void_param;
	int ret;

	/* RESET REQ has no parameter */
	void_param = ke_msg_alloc(MM_RESET_REQ, TASK_MM, TASK_API, 0);
	if (!void_param)
		return -1;

	/* hal_machw_reset (kick->poll->crm_mdm_reset) runs inside the ke task
	 * between this send and the CFM, so latch the hardware state on both
	 * sides.  All probe logic lives in hal_port/scan_diagnostics.c; this file
	 * keeps only the call, the same way bk7258_scan_diag_record() is used. */
	bk7258_hwprobe_latch(BK7258_HWPROBE_PRE_RESET, -1, 0);
	ret = rw_msg_send(void_param, 1, MM_RESET_CFM, NULL);
	bk7258_hwprobe_latch(BK7258_HWPROBE_POST_RESET, -1, ret);

	return ret;
}

int rw_msg_send_start(void)
{
	struct mm_start_req *start_req_param;
	int ret;

	/* Build the START REQ message */
	start_req_param = ke_msg_alloc(MM_START_REQ, TASK_MM, TASK_API,
								   sizeof(struct mm_start_req));
	if (!start_req_param)
		return -1;

