JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
	/* Set parameters for the START message */
	start_req_param->phy_cfg.parameters[0] = 1;
	start_req_param->phy_cfg.parameters[1] = 0;
	start_req_param->uapsd_timeout = 300;
	start_req_param->rx_hostbuf_size = 8192;
#if CONFIG_PM_V2
	if (bk_pm_lpo_src_get() == PM_LPO_SRC_DIVD)
		start_req_param->lp_clk_accuracy = 20;
	else if (bk_pm_lpo_src_get() == PM_LPO_SRC_X32K)
		start_req_param->lp_clk_accuracy = 100;
	else
		start_req_param->lp_clk_accuracy = 1000;

#else
	start_req_param->lp_clk_accuracy = 20;
#endif
	/* Send the START REQ message to LMAC FW */
	/* ke_state(TASK_MM) is sampled alongside the registers because mm_active()
	 * is the only writer that moves the NXMAC FSM off 0 (nxmac_next_state_setf
	 * (3) -> 0x49100038 = 0x30) and it runs in the MM_START_REQ handler tail
	 * next to ke_state_set(TASK_MM, MM_ACTIVE).  Unlike a register read it is
	 * the library's own memory variable, so the pair cannot be dismissed as a
	 * bad probe.  Reading order and interpretation live with the report, in
	 * hal_port/scan_diagnostics.c and bk7258_wifi_lower.c. */
	bk7258_hwprobe_latch(BK7258_HWPROBE_PRE_START, ke_state_get(TASK_MM), 0);
	ret = rw_msg_send(start_req_param, 1, MM_START_CFM, NULL);
	bk7258_hwprobe_latch(BK7258_HWPROBE_POST_START,
			ke_state_get(TASK_MM), ret);
	return ret;
}

int rw_msg_send_me_config_req(void)
{
	struct me_config_req *req;
	struct wiphy *wiphy = &g_wiphy;
	int i;

#if CONFIG_WIFI4
	struct ieee80211_sta_erp_cap *erp_cap = &wiphy->bands[IEEE80211_BAND_2GHZ]->erp_cap;
	struct ieee80211_sta_ht_cap *ht_cap = &wiphy->bands[IEEE80211_BAND_2GHZ]->ht_cap;
	struct ieee80211_sta_vht_cap *vht_cap = &wiphy->bands[IEEE80211_BAND_5GHZ]->vht_cap;
	uint8_t *ht_mcs = (uint8_t *)&ht_cap->mcs;
#endif // CONFIG_WIFI4
	struct ieee80211_sta_he_cap const *he_cap;
	struct rwnx_hw *rwnx_hw = &g_rwnx_hw;

	/* Build the ME_CONFIG_REQ message */
	req = ke_msg_alloc(ME_CONFIG_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_config_req));
	if (!req)
		return -1;

	/* Set parameters for the ME_CONFIG_REQ message */
#if CONFIG_WIFI4
	req->erp_supp = erp_cap->erp_supported;
	req->ht_supp = ht_cap->ht_supported;
	req->vht_supp = vht_cap->vht_supported;
	req->ht_cap.ht_capa_info = cpu_to_le16(ht_cap->cap);
	req->ht_cap.a_mpdu_param = ht_cap->ampdu_factor |
							   (ht_cap->ampdu_density <<
								IEEE80211_HT_AMPDU_PARM_DENSITY_SHIFT);

	for (i = 0; i < sizeof(ht_cap->mcs); i++)
		req->ht_cap.mcs_rate[i] = ht_mcs[i];

	req->ht_cap.ht_extended_capa = 0;
	req->ht_cap.tx_beamforming_capa = 0;  //0x64000000 ? invalid bit[31:29] is reserved, bit[26:25]=0b10, 3 rows of CSI
	req->ht_cap.asel_capa = 0;  // Antenna Selection Capable: Not Supported

	req->vht_cap.vht_capa_info = cpu_to_le32(vht_cap->cap);
	req->vht_cap.rx_highest = cpu_to_le16(vht_cap->vht_mcs.rx_highest);
	req->vht_cap.rx_mcs_map = cpu_to_le16(vht_cap->vht_mcs.rx_mcs_map);
	req->vht_cap.tx_highest = cpu_to_le16(vht_cap->vht_mcs.tx_highest);
	req->vht_cap.tx_mcs_map = cpu_to_le16(vht_cap->vht_mcs.tx_mcs_map);
#endif // CONFIG_WIFI4

	if (wiphy->bands[IEEE80211_BAND_2GHZ]->iftype_data != NULL) {
		he_cap = &wiphy->bands[IEEE80211_BAND_2GHZ]->iftype_data->he_cap;

		req->he_supp = he_cap->has_he;
		for (i = 0; i < ARRAY_SIZE(he_cap->he_cap_elem.mac_cap_info); i++)
			req->he_cap.mac_cap_info[i] = he_cap->he_cap_elem.mac_cap_info[i];
		for (i = 0; i < ARRAY_SIZE(he_cap->he_cap_elem.phy_cap_info); i++)
			req->he_cap.phy_cap_info[i] = he_cap->he_cap_elem.phy_cap_info[i];
		req->he_cap.mcs_supp.rx_mcs_80 = cpu_to_le16(he_cap->he_mcs_nss_supp.rx_mcs_80);
		req->he_cap.mcs_supp.tx_mcs_80 = cpu_to_le16(he_cap->he_mcs_nss_supp.tx_mcs_80);
		req->he_cap.mcs_supp.rx_mcs_160 = cpu_to_le16(he_cap->he_mcs_nss_supp.rx_mcs_160);
		req->he_cap.mcs_supp.tx_mcs_160 = cpu_to_le16(he_cap->he_mcs_nss_supp.tx_mcs_160);
		req->he_cap.mcs_supp.rx_mcs_80p80 = cpu_to_le16(he_cap->he_mcs_nss_supp.rx_mcs_80p80);
		req->he_cap.mcs_supp.tx_mcs_80p80 = cpu_to_le16(he_cap->he_mcs_nss_supp.tx_mcs_80p80);
		for (i = 0; i < MAC_HE_PPE_THRES_MAX_LEN; i++)
			req->he_cap.ppe_thres[i] = he_cap->ppe_thres[i];
		req->he_ul_on = rwnx_hw->mod_params->he_ul_on;
	} else {
		req->he_supp = false;
		req->he_ul_on = false;
	}

	req->ps_on = rwnx_hw->mod_params->ps_on;		// TODO: BK7236 fix ps
	req->dpsm = rwnx_hw->mod_params->dpsm;			// TODO: BK7236 fix ps
	req->tx_lft = rwnx_hw->mod_params->tx_lft;
	req->ant_div_on = rwnx_hw->mod_params->ant_div;
	if (rwnx_hw->mod_params->use_80)
		req->phy_bw_max = PHY_CHNL_BW_80;
	else if (rwnx_hw->mod_params->use_2040)
		req->phy_bw_max = PHY_CHNL_BW_40;
	else
		req->phy_bw_max = PHY_CHNL_BW_20;

	RWNX_LOGV("HT supp %d, VHT supp %d, HE supp %d\n", req->ht_supp, req->vht_supp, req->he_supp);

#if CONFIG_PM_V2
	req->ps_on = 1;
#endif

	/* Send the ME_CONFIG_REQ message to LMAC FW */
	return rw_msg_send(req, 1, ME_CONFIG_CFM, NULL);
}

int find_ieee80211_channel_flags(int channel, struct ieee80211_channel *channels, int num_channels)
{
	for (int i = 0; i < num_channels; i++) {
		if (channel == channels[i].hw_value)
			return channels[i].flags;
	}
	return 0;
}

int rw_msg_send_me_chan_config_req(void)
{
	struct me_chan_config_req *req;
	struct wiphy *wiphy = &g_wiphy;
	int i;

	/* Build the ME_CHAN_CONFIG_REQ message */
	req = ke_msg_alloc(ME_CHAN_CONFIG_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_chan_config_req));
	if (!req)
		return -1;

	req->chan2G4_cnt =  0;
	if (wiphy->bands[IEEE80211_BAND_2GHZ]->n_channels) {
		struct ieee80211_supported_band *b = wiphy->bands[IEEE80211_BAND_2GHZ];
		for (i = 0; i < b->n_channels; i++) {
			req->chan2G4[req->chan2G4_cnt].flags = 0;

			if (b->channels[i].flags & IEEE80211_CHAN_DISABLED)
				req->chan2G4[req->chan2G4_cnt].flags |= SCAN_DISABLED_BIT;

			req->chan2G4[req->chan2G4_cnt].band = IEEE80211_BAND_2GHZ;
			req->chan2G4[req->chan2G4_cnt].freq = b->channels[i].center_freq;
			req->chan2G4[req->chan2G4_cnt].tx_power = VIF_UNDEF_POWER;
			req->chan2G4_cnt++;

			if (req->chan2G4_cnt == SCAN_CHANNEL_2G4)
				break;
		}
	}

	req->chan5G_cnt = 0;
#if CONFIG_WIFI_BAND_5G
	if (wiphy->bands[IEEE80211_BAND_5GHZ]->n_channels) {
		int selected_channels_size = 0;
		struct ieee80211_supported_band *b = wiphy->bands[IEEE80211_BAND_5GHZ];
		extern int* rw_select_5g_channels_by_regulatory_domain(int *selected_channels_size);
		int *selected_channels_5g = rw_select_5g_channels_by_regulatory_domain(&selected_channels_size);
		for (i = 0; i < selected_channels_size; i++) {
			req->chan5G[req->chan5G_cnt].flags = 0;

			int flag = find_ieee80211_channel_flags(selected_channels_5g[i], b->channels, b->n_channels);

			if (flag & IEEE80211_CHAN_DISABLED)
				req->chan5G[req->chan5G_cnt].flags |= SCAN_DISABLED_BIT;

			req->chan5G[req->chan5G_cnt].band = IEEE80211_BAND_5GHZ;
			req->chan5G[req->chan5G_cnt].freq = (5000 + (5 *selected_channels_5g[i]));
			req->chan5G[req->chan5G_cnt].tx_power = VIF_UNDEF_POWER;
			req->chan5G_cnt++;
			if (req->chan5G_cnt == SCAN_CHANNEL_5G)
				break;
		}
	}
#endif
	/* Send the ME_CHAN_CONFIG_REQ message to LMAC FW */
	return rw_msg_send(req, 1, ME_CHAN_CONFIG_CFM, NULL);
}

int rw_msg_send_add_if(const unsigned char *mac,
					   enum nl80211_iftype iftype,
					   bool p2p,
					   struct mm_add_if_cfm *cfm)
{
	struct mm_add_if_req *add_if_req_param;

	/* Build the ADD_IF_REQ message */
	add_if_req_param = ke_msg_alloc(MM_ADD_IF_REQ, TASK_MM, TASK_API,
									sizeof(struct mm_add_if_req));
	if (!add_if_req_param)
		return BK_ERR_NO_MEM;

