JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
#if CONFIG_P2P
	p2p = false;
	add_if_req_param->p2p_rec_probe_req = true;
#endif
	/* Set parameters for the ADD_IF_REQ message */
	os_memcpy(&(add_if_req_param->addr.array[0]), mac, ETH_ALEN);
	switch (iftype) {
#if CONFIG_P2P
	case NL80211_IFTYPE_P2P_CLIENT:
		p2p = true;
		/* fall through */
#endif
	case NL80211_IFTYPE_STATION:
		add_if_req_param->type = VIF_STA;
		break;

	case NL80211_IFTYPE_ADHOC:
		add_if_req_param->type = VIF_IBSS;
		break;

#if CONFIG_P2P
	case NL80211_IFTYPE_P2P_GO:
		p2p = true;
		/* fall through */
#endif
	case NL80211_IFTYPE_AP:
		add_if_req_param->type = VIF_AP;
		break;

	case NL80211_IFTYPE_MESH_POINT:
		add_if_req_param->type = VIF_MESH_POINT;
		break;

	case NL80211_IFTYPE_MONITOR:
		add_if_req_param->type = VIF_MONITOR;
		break;

	default:
		add_if_req_param->type = VIF_STA;
		break;
	}

	add_if_req_param->p2p = p2p;

	if (mac_vif_mgmt_get_used_cnt() > 0)
	{
#if CONFIG_CUS_MAC_MASK
	    add_if_req_param->mac_addr_hi_mask = 0;
	    add_if_req_param->mac_addr_low_mask = 0x2;
#else
	    add_if_req_param->mac_addr_low_mask = 0x2;
	    add_if_req_param->mac_addr_hi_mask = ((NX_VIRT_DEV_MAX - 1) << 8);
#endif
	}

	/* Send the ADD_IF_REQ message to LMAC FW */
	return rw_msg_send(add_if_req_param, 1, MM_ADD_IF_CFM, cfm);
}

int rw_msg_send_remove_if(u8 vif_index)
{
	struct ke_msg cfm;
	struct mm_remove_if_req *remove_if_req;

	/* Build the MM_REMOVE_IF_REQ message */
	remove_if_req = ke_msg_alloc(MM_REMOVE_IF_REQ, TASK_MM, TASK_API,
								 sizeof(struct mm_remove_if_req));
	if (!remove_if_req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the MM_REMOVE_IF_REQ message */
	remove_if_req->inst_nbr = vif_index;

	/* Send the MM_REMOVE_IF_REQ message to LMAC FW */
	return rw_msg_send(remove_if_req, 1, MM_REMOVE_IF_CFM, &cfm);
}

int rw_msg_send_version_req(void)
{
	void *void_param;
	struct mm_version_cfm *cfm = &g_rwnx_hw.version_cfm;

	/* VERSION REQ has no parameter */
	void_param = ke_msg_alloc(MM_VERSION_REQ, TASK_MM, TASK_API, 0);
	if (!void_param)
		return BK_ERR_NO_MEM;

	return rw_msg_send(void_param, 1, MM_VERSION_CFM, cfm);
}

// TODO: BK7236, call this function in wpa_s instead
int rw_msg_send_config_monitor_req(struct mac_chan_op *chan, struct me_config_monitor_cfm *cfm)
{
	struct me_config_monitor_req *req;

	//FHOST_DBG(FHOST_FN_ENTRY_STR);

	/* Build the ME_CONFIG_MONITOR_REQ message */
	req = ke_msg_alloc(ME_CONFIG_MONITOR_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_config_monitor_req));
	if (!req)
		return -1;

	if (chan) {
		req->chan_set = true;
		req->chan = *chan;
	} else
		req->chan_set = false;

	req->uf = rwnx_mod_params.uf;

	/* Send the ME_CONFIG_MONITOR_REQ message to FW */
	return rw_msg_send(req, 1, ME_CONFIG_MONITOR_CFM, cfm);
}

// TODO: BK7236, call this function in wpa_s instead
int rwnx_monitor_open()
{
	int                     ret = 0;
	struct mm_add_if_cfm    add_if_cfm;
	uint8_t                 mac_addr[ETH_ALEN];
	struct rwnx_hw *rwnx_hw = &g_rwnx_hw;

	if (rwnx_hw->monitor_vif != RWNX_INVALID_VIF)
		return 0;

	bk_wifi_sta_get_mac((uint8_t *)mac_addr);

	if ((ret = rw_msg_send_add_if(mac_addr, NL80211_IFTYPE_MONITOR, 0, &add_if_cfm)))
		return ret;

	if (add_if_cfm.status != 0) {
		//dbg(D_ERR D_FHOST "FHOST: add virtual iface error(status=%d)!\r\n", add_if_cfm.status);

		return -1;
	}

	rwnx_hw->monitor_vif = add_if_cfm.inst_nbr;

	return ret;
}

// TODO: BK7236, call this function in wpa_s instead
int rwnx_monitor_close()
{
	struct rwnx_hw *rwnx_hw = &g_rwnx_hw;
	int ret;

	if (rwnx_hw->monitor_vif == RWNX_INVALID_VIF)
		return 0;

	ret = rw_msg_send_remove_if(rwnx_hw->monitor_vif);
	if (!ret)
		// successfully removed the monitor interface
		rwnx_hw->monitor_vif = RWNX_INVALID_VIF;

	return ret;
}

#if NX_TWT
#ifdef CONFIG_WPA_TWT_TEST
int rwnx_msg_send_twt_setup(uint8_t setup_type, uint16_t mantissa, uint8_t min_twt)
{
	int ret = 0;
	unsigned char vif_idx = wifi_netif_mac_to_vifid((uint8_t*)&g_sta_param_ptr->own_mac);
	struct twt_conf_tag twt_conf;
	struct twt_setup_cfm *twt_setup_cfm
		= (struct twt_setup_cfm *)os_malloc(sizeof(struct twt_setup_cfm));
	if (NULL == twt_setup_cfm) {
		RWNX_LOGD("twt setup failed: oom\r\n");
		return BK_ERR_NO_MEM;
	}

	os_memset(&twt_conf, 0, sizeof(twt_conf));
	twt_conf.flow_type = 1;
	twt_conf.wake_int_exp = 10;
	twt_conf.wake_dur_unit = 0;
	twt_conf.wake_int_mantissa = mantissa;
	twt_conf.min_twt_wake_dur = min_twt;

	RWNX_LOGD("TWT: Setup request, setup_command: %d  mantissa: %d  min_twt: %d\n",
		  setup_type, twt_conf.wake_int_mantissa, twt_conf.min_twt_wake_dur);

	ret = rw_msg_send_twt_setup(setup_type, vif_idx, &twt_conf, twt_setup_cfm);
	if (!ret && (twt_setup_cfm->status == CO_OK))
		RWNX_LOGD("set up success\r\n");
	else
		RWNX_LOGD("set up fail, ret = %d\r\n", ret);
	os_free(twt_setup_cfm);
	return ret;

}

int rwnx_msg_send_twt_teardown(void)
{
	int i = 0;
	int ret = 0;
	unsigned char vif_idx = wifi_netif_mac_to_vifid((uint8_t*)&g_sta_param_ptr->own_mac);

	for (i = 0; i < NX_TWT_FLOW_NB; i++)
	{
	 	// Check if flow is valid
		if (twt_flow_tab[i].control & TWT_CTRL_VALID) {
			RWNX_LOGD("TWT: teardown, vif_idx: %d  id: %d\n", vif_idx, twt_flow_tab[i].id);
			ret = rw_msg_send_twt_teardown(vif_idx, twt_flow_tab[i].id);
		}
	}

	if (!ret)
		RWNX_LOGD( "tear down success\r\n");
	else
		RWNX_LOGD( "tear down fail, ret = %d\r\n", ret);
	return ret;
}
#endif


int rw_msg_send_twt_setup(uint8_t setup_type, uint8_t vif_idx, struct twt_conf_tag *twt_conf, struct twt_setup_cfm *cfm)
{
	struct twt_setup_req *req;

	req = ke_msg_alloc(TWT_SETUP_REQ, TASK_TWT, TASK_API,
					   sizeof(struct twt_setup_req));
	if (!req)
		return -1;

	req->vif_idx = vif_idx;
	req->setup_type = setup_type;
	os_memcpy(&req->conf, twt_conf, sizeof(*twt_conf));

	return rw_msg_send(req, 1, TWT_SETUP_CFM, cfm);
}

int rw_msg_send_twt_teardown(uint8_t vif_idx, uint8_t flow_id)
{
	struct twt_teardown_req *twt_teardown;
	struct twt_teardown_cfm twt_teardown_cfm;

	twt_teardown = ke_msg_alloc(TWT_TEARDOWN_REQ, TASK_TWT, TASK_API,
								sizeof(struct twt_teardown_req));

	twt_teardown->id = flow_id;
	twt_teardown->neg_type = 0; // XXX MAC_TWT_CTRL_NEGOT_INDIV;
	twt_teardown->all_twt = 0;
	twt_teardown->vif_idx = vif_idx;

	return rw_msg_send(twt_teardown, 1, TWT_TEARDOWN_CFM, &twt_teardown_cfm);
}
#endif

int rw_msg_set_default_ac(uint32_t ac)
{
	struct mm_set_def_ac_req *cfg_ac = ke_msg_alloc(MM_SET_DEFAULT_AC_REQ, TASK_MM, TASK_ME, sizeof(struct mm_set_def_ac_req));

	cfg_ac->ac_param = ac;

	return rw_msg_send(cfg_ac, 0, 0, NULL);
}

