JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
int rw_msg_get_machw_mib_req(uint32_t mib_bit, void *cfm)
{
	struct mm_get_machw_mib_req *req;
	/* Build the MM_GET_MACHW_MIB_REQ message */
	req = ke_msg_alloc(MM_GET_MACHW_MIB_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_get_machw_mib_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->mib_bit = mib_bit;

	/* Send the MM_GET_MACHW_MIB_CFM message to FW */
	return rw_msg_send(req, 1, MM_GET_MACHW_MIB_CFM, cfm);
}

int rw_send_me_rc_set_rate(u8 sta_idx, u16 rate_cfg)
{
	struct me_rc_set_rate_req *req;

	/* Build the ME_RC_SET_RATE_REQ message */
	req = ke_msg_alloc(ME_RC_SET_RATE_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_rc_set_rate_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters for the ME_RC_SET_RATE_REQ message */
	req->sta_idx = sta_idx;
	req->fixed_rate_cfg = rate_cfg;

	/* Send the ME_RC_SET_RATE_REQ message to FW */
	return rw_msg_send(req, 0, 0, NULL);
}

int rw_send_me_traffic_ind(u8 sta_idx, bool uapsd, u8 tx_status)
{
    struct me_traffic_ind_req *req;

    /* Build the ME_UTRAFFIC_IND_REQ message */
    req = ke_msg_alloc(ME_TRAFFIC_IND_REQ, TASK_ME, TASK_API,
                          sizeof(struct me_traffic_ind_req));
    if (!req)
        return BK_ERR_NO_MEM;

    /* Set parameters for the ME_TRAFFIC_IND_REQ message */
    req->sta_idx = sta_idx;
    req->tx_avail = tx_status;
    req->uapsd = uapsd;

    /* Send the ME_TRAFFIC_IND_REQ to UMAC FW */
    return rw_msg_send(req, 0, ME_TRAFFIC_IND_CFM, NULL);
}

int rw_send_apm_probe_req(uint8_t vif_index, uint8_t sta_idx,
			struct apm_probe_client_cfm *cfm)
{
	struct apm_probe_client_req *req;

	req = ke_msg_alloc(APM_PROBE_CLIENT_REQ, TASK_APM, TASK_API,
					   sizeof(struct apm_probe_client_req));
	if (!req)
		return -ENOMEM;

	req->vif_idx = vif_index;
	req->sta_idx = sta_idx;

	/* Send the APM_PROBE_CLIENT_REQ message to UMAC FW */
	return rw_msg_send(req, 1, APM_PROBE_CLIENT_CFM, cfm);
}

#if NX_VERSION < NX_VERSION_PACK(6, 22, 0, 0)
int rw_msg_set_app_filter(uint32_t filter)
{
	struct mm_set_filter_req *set_filter_req_param;
	//uint32_t rx_filter = 0;

	/* Build the MM_SET_FILTER_REQ message */
	set_filter_req_param =
		ke_msg_alloc(MM_SET_APP_FILTER_REQ, TASK_MM, TASK_API,
					 sizeof(struct mm_set_filter_req));
	if (!set_filter_req_param)
		return BK_ERR_NO_MEM;

	/* Now copy all the flags into the message parameter */
	set_filter_req_param->filter = filter;

	/* Send the MM_SET_FILTER_REQ message to LMAC FW */
	return rw_msg_send(set_filter_req_param, 1, MM_SET_APP_FILTER_CFM, NULL);
}
#endif

u8_t supp_multi_proto = 0;

void set_multicast_flag(void) {
	supp_multi_proto = 1;
}

u8_t get_multicast_flag(void) {
	return supp_multi_proto;
}

int rw_msg_dhcp_done_ind(u8 vif_idx)
{
	struct me_dhcp_done_ind *ind = ke_msg_alloc(ME_DHCP_DONE_IND, TASK_ME, TASK_API,
					sizeof(struct me_dhcp_done_ind));

	if (!ind)
		return BK_ERR_NO_MEM;

	ind->vif_idx = vif_idx;
	ind->multi_pro_flag = get_multicast_flag();

#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
	rwnx_dhcp_done_handler(vif_idx);  // FIXME: move to right place.
#endif

	return rw_msg_send(ind, 0, 0, NULL);
}

int rw_msg_ap_dhcp_done_ind(uint8_t *hdr)
{
	struct csi_dhcp_done_ind *ind = ke_msg_alloc(CSI_DHCP_DONE_IND, TASK_CSI, TASK_API,
					sizeof(struct csi_dhcp_done_ind));

	if (!ind)
		return BK_ERR_NO_MEM;

	ind->vif_idx = 0xFF;
	os_memcpy(ind->mac,hdr,MAC_ADDR_LEN);

	return rw_msg_send(ind, 0, 0, NULL);
}

// #if CONFIG_WIFI_MFP_CONNECT_DEAUTH
int rw_msg_mfp_connect_deauth(u8 vif_idx,u8 *bssid,bool encrypt,
											u8 *pn,u16 seq,struct mac_sec_key *key, bool is_first_connect)
{
	struct me_mfp_connect_deauth_ind *ind = ke_msg_alloc(ME_MFP_CONNECT_DEAUTH_IND, TASK_ME, TASK_API,
					sizeof(struct me_mfp_connect_deauth_ind));

	if (!ind)
		return BK_ERR_NO_MEM;

	ind->vif_idx = vif_idx;
	ind->is_mfp_support = encrypt;
	ind->seq = seq;
	ind->is_first_connect = is_first_connect;

	os_memcpy(&ind->bssid,bssid,sizeof(ind->bssid));
	os_memcpy(ind->pn, pn, sizeof(ind->pn));
	os_memcpy(&ind->key, key, sizeof(ind->key));

	return rw_msg_send(ind, 0, 0, NULL);
}
// #endif

static ap_param_t *rw_msg_ap_param_for_vif(u8 vif_index)
{
	ap_param_t *ap_param = g_ap_param_ptr;
#if CONFIG_P2P
	void *vif = mac_vif_mgmt_get_entry(vif_index);

	if (vif && mac_vif_mgmt_get_type(vif) == VIF_AP &&
	    mac_vif_mgmt_interface_is_configured_for_p2p(vif))
		ap_param = bk_wifi_p2p_go_ap_param_ensure();
#endif
	return ap_param;
}

int rw_msg_send_apm_start_req(u8 vif_index, u8 channel,
							  struct apm_start_cfm *cfm)
{
	struct apm_start_req *req;
	ap_param_t *ap_param;

	/* Build the APM_START_REQ message */
	req = ke_msg_alloc(APM_START_REQ, TASK_APM, TASK_API,
					   sizeof(struct apm_start_req) + sizeof(beacon));
	if (!req)
		return -1;

	req->basic_rates.length = 4;
	req->basic_rates.array[0] = 130;
	req->basic_rates.array[1] = 132;
	req->basic_rates.array[2] = 139;
	req->basic_rates.array[3] = 150;

	req->chan.band = 0;
	req->chan.flags = 0;
	req->chan.prim20_freq = req->chan.center1_freq = rw_ieee80211_get_centre_frequency(channel);
	req->chan.center2_freq = 0;

	// FIXME: BK7239 6E channel starts with channel 1
	if (channel <= 14) {
		req->chan.band = PHY_BAND_2G4;
	} else {
		req->chan.band = PHY_BAND_5G;
	}

	req->chan.type = PHY_CHNL_BW_20;

	req->bcn_addr = (UINT32)(req + 1);
	req->bcn_len = sizeof(beacon);
	os_memcpy(req + 1, beacon, sizeof(beacon));
	req->tim_oft = 56;
	req->tim_len = 6;
	req->bcn_int = BEACON_INTERVAL;

#if CONFIG_P2P
	{
		void *vif = mac_vif_mgmt_get_entry(vif_index);
		int p2p_go_ap = vif && mac_vif_mgmt_get_type(vif) == VIF_AP &&
				mac_vif_mgmt_interface_is_configured_for_p2p(vif);

		if (p2p_go_ap) {
			req->flags = USE_PAIRWISE_KEY | USE_PRIVACY | CONTROL_PORT_HOST;
		} else
#endif
	{
		ap_param = rw_msg_ap_param_for_vif(vif_index);
		if (ap_param && ap_param->cipher_suite > BK_SECURITY_TYPE_WEP) {
			req->flags = USE_PAIRWISE_KEY;
			req->flags |= USE_PRIVACY;
			req->flags |= CONTROL_PORT_HOST;
		} else {
			req->flags = 0;
		}
	}
#if CONFIG_P2P
	}
#endif

#ifdef CONFIG_AP_PS
	req->flags |= VIF_AP_PS;
#endif

	req->ctrl_port_ethertype = PP_HTONS(ETH_P_PAE);
	req->vif_idx = vif_index;

	RWNX_LOGV("apm start with vif:%d\r\n", vif_index);

	return rw_msg_send(req, 1, APM_START_CFM, cfm);
}

int rw_msg_send_apm_stop_req(u8 vif_index)
{
	struct apm_stop_req *req;

	/* Build the APM_STOP_REQ message */
	req = ke_msg_alloc(APM_STOP_REQ, TASK_APM, TASK_API,
					   sizeof(struct apm_stop_req));
	if (!req)
		return -1;

	/* Set parameters for the APM_STOP_REQ message */
	req->vif_idx = vif_index;
	RWNX_LOGD("send apm stop req, vif=%d\n", vif_index);

	/* Send the APM_STOP_REQ message to LMAC FW */
	return rw_msg_send(req, 1, APM_STOP_CFM, NULL);
}

