JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
int rw_msg_send_bcn_change(void *bcn_param)
{
	struct mm_bcn_change_req *req;
	BCN_PARAM_PTR param = (BCN_PARAM_PTR)bcn_param;

	/* Build the MM_BCN_CHANGE_REQ message */
	req = ke_msg_alloc(MM_BCN_CHANGE_REQ, TASK_MM, TASK_API,
					   sizeof(struct mm_bcn_change_req) + param->bcn_len);
	if (!req)
		return -1;

	/* Set parameters for the MM_BCN_CHANGE_REQ message */
	req->bcn_ptr = (u32)(req + 1);
	req->bcn_len = param->bcn_len;
	os_memcpy(req + 1, param->bcn_ptr, req->bcn_len);
	req->tim_len = param->tim_len;
	req->tim_oft = param->tim_oft;
	req->inst_nbr = param->vif_idx;

	for (int i = 0; i < BCN_MAX_CSA_CPT; i++)
		req->csa_oft[i] = param->csa_oft[i];

#if CONFIG_AP_IDLE
	if (ap_ps_enable_get() &&
		!bk_wlan_has_role(VIF_STA) && bk_wlan_has_role(VIF_AP))
		start_global_ap_bcn_timer();
#endif

	/* Send the MM_BCN_CHANGE_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_BCN_CHANGE_CFM, NULL);
}


int rw_msg_send_me_sta_add(struct add_sta_st *param,
						   struct me_sta_add_cfm *cfm)
{
	struct me_sta_add_req *req;

	/* Build the MM_STA_ADD_REQ message */
	req = ke_msg_alloc(ME_STA_ADD_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_sta_add_req));
	if (!req)
		return BK_ERR_NO_MEM;

#if CONFIG_AP_IDLE
	ap_idle_stop();
#endif
	/* Set parameters for the MM_STA_ADD_REQ message */
	os_memcpy(&(req->mac_addr.array[0]), param->sta_addr, ETH_ALEN);

	req->vif_idx = param->ap_vif_idx;
	req->aid = param->aid;
	req->flags = param->flags; // 1:STA_QOS_CAPA 2: STA_HT_CAPA BIT(3)STA_MFP_CAPA

	RWNX_LOGD("hapd_intf_sta_add:%d, vif:%d\r\n", req->aid, req->vif_idx);

	req->rate_set.length = 12;
	req->rate_set.array[0] = 130;
	req->rate_set.array[1] = 132;
	req->rate_set.array[2] = 139;
	req->rate_set.array[3] = 150;
	req->rate_set.array[4] = 36;
	req->rate_set.array[5] = 48;
	req->rate_set.array[6] = 72;
	req->rate_set.array[7] = 108;
	req->rate_set.array[8] = 12;
	req->rate_set.array[9] = 18;
	req->rate_set.array[10] = 24;
	req->rate_set.array[11] = 96;

	req->ht_cap.mcs_rate[0] = 255;

	/* Send the ME_STA_ADD_REQ message to LMAC FW */
	return rw_msg_send(req, 1, ME_STA_ADD_CFM, cfm);
}

int rw_msg_send_me_sta_del(u8 sta_idx, bool tdls_sta)
{
	struct me_sta_del_req *req;

	/* Build the MM_STA_DEL_REQ message */
	req = ke_msg_alloc(ME_STA_DEL_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_sta_del_req));
	if (!req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the MM_STA_DEL_REQ message */
	req->sta_idx = sta_idx;
	req->tdls_sta = tdls_sta;

	/* Send the ME_STA_DEL_REQ message to LMAC FW */
	return rw_msg_send(req, 1, ME_STA_DEL_CFM, NULL);
}

int rw_msg_me_set_control_port_req(bool opened, u8 sta_idx)
{
	struct me_set_control_port_req *req;

	/* Build the ME_SET_CONTROL_PORT_REQ message */
	req = ke_msg_alloc(ME_SET_CONTROL_PORT_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_set_control_port_req));
	if (!req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the ME_SET_CONTROL_PORT_REQ message */
	req->sta_idx = sta_idx;
	req->control_port_open = opened;

	/* Send the ME_SET_CONTROL_PORT_REQ message to LMAC FW */
	return rw_msg_send(req, 1, ME_SET_CONTROL_PORT_CFM, NULL);
}

int rw_msg_send_key_add(KEY_PARAM_T *param, struct mm_key_add_cfm *cfm)
{
	struct mm_key_add_req *key_add_req;

	/* Build the MM_KEY_ADD_REQ message */
	key_add_req = ke_msg_alloc(MM_KEY_ADD_REQ, TASK_MM, TASK_API,
							   sizeof(struct mm_key_add_req));
	if (!key_add_req) {
		RWNX_LOGD("rw_msg_send_key_add NULL\r\n");
		return BK_ERR_NO_MEM;
	}

	/* Set parameters for the MM_KEY_ADD_REQ message */
	if (param->sta_idx != 0xFF) {
		/* Pairwise key */
		key_add_req->sta_idx = param->sta_idx;
	} else {
		/* Default key */
		key_add_req->sta_idx = param->sta_idx;
		key_add_req->key_idx = param->key_idx; /* only useful for default keys */
	}

	key_add_req->spp = 0;
	key_add_req->pairwise = 0;
	key_add_req->inst_nbr = param->inst_nbr;
	key_add_req->key.length = param->key.length;
	os_memcpy(&(key_add_req->key.array[0]), &(param->key.array[0]), param->key.length);

	key_add_req->cipher_suite = param->cipher_suite;

	/* Send the MM_KEY_ADD_REQ message to LMAC FW */
	return rw_msg_send(key_add_req, 1, MM_KEY_ADD_CFM, cfm);
}

int rw_msg_send_key_del(u8 hw_key_idx)
{
	struct mm_key_del_req *key_del_req;

	/* Build the MM_KEY_DEL_REQ message */
	key_del_req = ke_msg_alloc(MM_KEY_DEL_REQ, TASK_MM, TASK_API,
							   sizeof(struct mm_key_del_req));
	if (!key_del_req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the MM_KEY_DEL_REQ message */
	key_del_req->hw_key_idx = hw_key_idx;

	/* Send the MM_KEY_DEL_REQ message to LMAC FW */
	return rw_msg_send(key_del_req, 1, MM_KEY_DEL_CFM, NULL);
}

#if defined(CONFIG_WIFI_SCAN_CH_TIME) && CONFIG_WIFI_SCAN_CH_TIME
struct scan_chan_duration_tag scancd_env = {0};

void set_scan_chan_duration_param(unsigned char chnb, struct scan_chan_duration_item *param)
{
	scancd_env.table_nm = chnb;
	scancd_env.tb = param;
}
#endif

struct scan_cfg_scan_param_tag scan_param_env = {0};
struct scan_cfg_scan_param_tag scan_param_dump_env = {0};


int rw_msg_send_scanu_req(SCAN_PARAM_T *scan_param)
{
	int i;
	struct scanu_start_req *req;
	uint8_t *extra_ies;

	/* Build the SCANU_START_REQ message */
	req = ke_msg_alloc(SCANU_START_REQ, TASK_SCANU, TASK_API,
					   sizeof(struct scanu_start_req) + scan_param->extra_ies_len);
	if (!req) {
		bk7258_scan_diag_record(BK7258_SCAN_DIAG_REQUEST_BUILD_FAIL);
		RWNX_LOGE("scanu req alloc failed\r\n");
		return BK_ERR_NO_MEM;
	}

	extra_ies = (uint8_t *)(req + 1);

	/* Set parameters */
	req->vif_idx = scan_param->vif_idx;
	req->no_cck = 0;

	int *freqs = scan_param->freqs;
	if (!freqs[0]) {
		/* no specified freq, set to all freqs supported */
		rw_ieee80211_init_scan_chan(req);
	} else {
		/* specified freqs: XXX 5g band */
		for (i = 0; i < ARRAY_SIZE(scan_param->freqs); i++, freqs++) {
			if (!*freqs)
				break;
			if (req->chan[i].freq >= 5925) {
				req->chan[i].band = IEEE80211_BAND_6GHZ;   /// FIXME: BK7239 6E
			} else if (req->chan[i].freq >= 4900) {
				req->chan[i].band = IEEE80211_BAND_5GHZ;
			} else {
				req->chan[i].band = IEEE80211_BAND_2GHZ;
			}
			req->chan[i].flags = 0;
			req->chan[i].freq = *freqs;
			req->chan[i].tx_power = VIF_UNDEF_POWER;

			#if CONFIG_WIFI_AUTO_COUNTRY_CODE
			// If auto mode, disable 12, 13 active scan
			if (country_code_policy_is_auto() &&
					(req->chan[i].freq == 2467 || req->chan[i].freq == 2472 || req->chan[i].freq == 2484)) {
					req->chan[i].flags |= CHAN_NO_IR;
					// BK_LOGD(NULL,"XXX disable IR chan for %d\n", req->chan[i].freq);
			}
			#endif // CONFIG_WIFI_AUTO_COUNTRY_CODE
		}
		req->chan_cnt = i;
		// RWNX_LOGD("XXX Using specified freqs, chan_cnt %d\n", req->chan_cnt);
	}

