JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
	os_memcpy(&req->bssid, &scan_param->bssid, sizeof(req->bssid));
	req->ssid_cnt = scan_param->num_ssids;
	for (i = 0; i < req->ssid_cnt; i++) {
		req->ssid[i].length = scan_param->ssids[i].length;
		os_memcpy(req->ssid[i].array, scan_param->ssids[i].array, req->ssid[i].length);
	}

#if defined(CONFIG_WIFI_SCAN_CH_TIME) && CONFIG_WIFI_SCAN_CH_TIME
	if (scancd_env.table_nm) {
		int j;
		uint16_t freq;
		if (scancd_env.tb != NULL) {
			for (i = 0; i < scancd_env.table_nm; i++) {
				freq = rw_ieee80211_get_centre_frequency(scancd_env.tb[i].ch_nb);
				if (scancd_env.tb[i].ch_nb == 0 || freq == 0) {
					RWNX_LOGD("channel_number error\r\n");
					break;
				}

				for (j = 0; j < req->chan_cnt; j++) {
					if (req->chan[j].freq == freq) {
						req->duration[j] = scancd_env.tb[i].duration;
						break;
					}
				}
			}
		}
	}
#endif

	if (scan_param_env.set_param) {
		if(0 == scan_param_env.chan_cnt)
		{
			if(0 != scan_param_env.scan_type) {
				for (i = 0; i < req->chan_cnt; i++) {
					req->chan[i].flags |= CHAN_NO_IR;
				}
			}
		} else {
			for (i = 0; i < scan_param_env.chan_cnt; i++) {
				uint16_t freq;
				freq = rw_ieee80211_get_centre_frequency(scan_param_env.chan_nb[i]);
				if (freq == 0) {
					RWNX_LOGD("channel_number error\r\n");
					break;
				}
				req->chan[i].freq = freq;
				req->chan[i].tx_power = VIF_UNDEF_POWER;
				if (req->chan[i].freq >= 5925) {
					req->chan[i].band = IEEE80211_BAND_6GHZ;
				} else if (req->chan[i].freq >= 4900) {
					req->chan[i].band = IEEE80211_BAND_5GHZ;
				} else {
					req->chan[i].band = IEEE80211_BAND_2GHZ;
				}

				if(1 == scan_param_env.scan_type)
					req->chan[i].flags |= CHAN_NO_IR;
				else
					req->chan[i].flags = 0;
			}
			req->chan_cnt = i;
			RWNX_LOGV("Using specified freqs\n");
		}
		req->duration = scan_param_env.duration;

		os_memcpy(&scan_param_dump_env, &scan_param_env, sizeof(scan_param_env));
		scan_param_env.set_param = 0;

	}

	req->add_ie_len = scan_param->extra_ies_len;
	os_memcpy(extra_ies, scan_param->extra_ies, req->add_ie_len);
	req->add_ies = (uint32_t)extra_ies;

	/* This is the final per-channel active/passive policy passed to LMAC.
	 * Record only aggregate counts: never export requested SSIDs, BSSID or IEs.
	 */
	{
		uint32_t active = 0;
		uint32_t passive = 0;

		for (i = 0; i < req->chan_cnt; i++) {
			if (req->chan[i].flags & CHAN_NO_IR)
				passive++;
			else
				active++;
		}

		bk7258_scan_diag_request_channels(req->chan_cnt, active, passive);
	}

	/* Send the SCANU_START_REQ message to LMAC FW */
	return rw_msg_send(req, 0, SCANU_START_CFM, NULL);
}

int rw_msg_send_scanu_fast_req(FAST_SCAN_PARAM_T *fscan_param)
{
	struct scanu_fast_req *req;

	/* Build the SCANU_START_REQ message */
	req = ke_msg_alloc(SCANU_FAST_REQ, TASK_SCANU, TASK_API,
					   sizeof(struct scanu_fast_req));

	req->bssid = fscan_param->bssid;
	req->ch_nbr = fscan_param->ch_num;
	req->maxch_time = fscan_param->max_ch_time;
	req->minch_time = fscan_param->min_ch_time;
	req->probe_delay = fscan_param->probe_delay;
	req->ssid = fscan_param->ssid;

	return rw_msg_send(req, 0, SCANU_FAST_CFM, NULL);
}

int rw_msg_send_connection_loss_ind(u8 vif_index)
{
	struct mm_connection_loss_ind *ind = ke_msg_alloc(MM_CONNECTION_LOSS_IND,
										 TASK_SM, TASK_API, sizeof(struct mm_connection_loss_ind));

	// Fill-in the indication message parameters
	ind->inst_nbr = vif_index;

	// Send the indication to the upper layers
	return rw_msg_send(ind, 0, 0, NULL);
}

int rw_msg_get_bss_info(u8 vif_idx, void *cfm)
{
	struct me_get_bss_info_req *req = NULL;

	if (vif_idx >= NX_VIRT_DEV_MAX)
		return -1;

	req = ke_msg_alloc(ME_GET_BSS_INFO_REQ, TASK_ME, TASK_API,
					   sizeof(struct me_get_bss_info_req));

	if (!req)
		return BK_ERR_NO_MEM;

	req->vif_idx = vif_idx;

	return rw_msg_send(req, 1, ME_GET_BSS_INFO_CFM, cfm);
}

int rw_msg_get_signal_info(u8 vif_idx, SIGNAL_INFO_PARAM_T *signal_info_param)
{
#if (NX_MDM_VER >= 20)
	uint8_t read_counter = 10;
#endif //(NX_MDM_VER >= 20)
	void *vif;
	struct phy_channel_info info;

	/* get channel frequency */
	phy_get_channel(&info, 0);
	signal_info_param->frequency = (info.info1 >> 16) & 0xffff;

	/* get link noise */
	signal_info_param->current_noise = 0;
#if (NX_MDM_VER >= 20)
		// If read noise value is 0, value is not valid because of re-sync between AGC clock
		// and AHB clock. Register value is updated once AGC is in listen state.
	while (read_counter--)
	{
		// During scan, config used is 1x1, noise has to be read to antenna 0
		int reg_noise = (int)bk_wifi_get_noise();
		if (reg_noise != 0)
		{
			signal_info_param->current_noise = reg_noise;
			break;
		}
	}
#endif //(NX_MDM_VER >= 20)

	/* get link signal */
	vif = mac_vif_mgmt_get_entry(vif_idx);
	signal_info_param->current_signal = mac_vif_mgmt_get_u_sta_rssi(vif);
	signal_info_param->avg_signal = mac_vif_mgmt_get_u_sta_smooth_rssi(vif);

	return 0;
}

int rw_msg_send_mm_signal_monitor(SIGNAL_MONITOR_PARAM_T *signal_monitor_param)
{
	struct mm_cfg_rssi_req *req;

	/* Build the MM_CFG_RSSI_REQ message */
	req = ke_msg_alloc(MM_CFG_RSSI_REQ, TASK_MM, TASK_API,
						sizeof(struct mm_cfg_rssi_req));
	if (!req)
		return BK_ERR_NO_MEM;

	req->vif_index = signal_monitor_param->vif_idx;
	req->rssi_thold = signal_monitor_param->threshold;
	req->rssi_hyst = signal_monitor_param->hysteresis;

	/* Send the MM_CFG_RSSI_REQ message to LMAC FW */
	return rw_msg_send(req, 0, 0/*DUMMY*/, NULL);
}

int rw_msg_get_channel_info(u8 vif_idx, PHY_CHAN_INFO_T *channel_info)
{
	struct phy_channel_info info;
	int channel;
	uint8_t band;

	/* get phy channel */
	phy_get_channel(&info, 0);

	band = info.info1 & 0xff;
	channel_info->frequency = (info.info1 >> 16) & 0xffff;
	channel_info->chanwidth = (info.info1 >> 8) & 0xff;
	channel_info->center_frq1 = info.info2 & 0xffff;
	channel_info->center_frq2 = (info.info2 >> 16) & 0xffff;

	/* frequency transfer into channel */
	channel = phy_freq_to_channel(band, channel_info->frequency);

	/* get seg1_idx */
	if (channel_info->center_frq2)
		channel_info->seg1_idx = 36 + (channel_info->center_frq2 - 5180) / 5;

