JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
	/* get sec_channel */
	if (channel_info->chanwidth == PHY_CHNL_BW_20)
		channel_info->sec_channel = 0;
	else if (channel_info->chanwidth == PHY_CHNL_BW_40) // FIXME ??
		channel_info->sec_channel = (((channel - 1) / 4) % 2) ? -1 : 1;

	return 0;
}

int rw_msg_get_channel(void *cfm)
{
	struct phy_channel_info info;

	phy_get_channel(&info, 0);

	return info.info2;
}

int rw_msg_set_filter(uint32_t filter)
{
	struct mm_set_filter_req *set_filter_req_param;

	/* Build the MM_SET_FILTER_REQ message */
	set_filter_req_param =
		ke_msg_alloc(MM_SET_FILTER_REQ, TASK_MM, TASK_API,
					 sizeof(struct mm_set_filter_req));
	if (!set_filter_req_param)
		return BK_ERR_NO_MEM;

	/* Now copy all the flags into the message parameter */
	set_filter_req_param->filter = filter;

	RWNX_LOGI("set_filter: filter=0x%x", filter);

	/* Send the MM_SET_FILTER_REQ message to LMAC FW */
	return rw_msg_send(set_filter_req_param, 1, MM_SET_FILTER_CFM, NULL);
}

int rw_msg_set_channel(uint32_t channel, uint32_t band_width, void *cfm)
{
	struct mm_set_channel_req *set_chnl_par;

	set_chnl_par = ke_msg_alloc(MM_SET_CHANNEL_REQ, TASK_MM, TASK_API,
								sizeof(struct mm_set_channel_req));
	if (!set_chnl_par)
		return BK_ERR_NO_MEM;

	// FIXME: BK7239 6E channel starts with channel 1
	if (channel <= 14) {
		set_chnl_par->chan.band = PHY_BAND_2G4;
	} else {
		set_chnl_par->chan.band = PHY_BAND_5G;
	}
	set_chnl_par->chan.type = band_width;//PHY_CHNL_BW_20;
	set_chnl_par->chan.prim20_freq = set_chnl_par->chan.center1_freq =
										 rw_ieee80211_get_centre_frequency(channel);
	set_chnl_par->chan.center2_freq = 0;
	set_chnl_par->chan.tx_power = VIF_UNDEF_POWER;
	set_chnl_par->index = PHY_PRIM;

	/* Send the MM_SET_CHANNEL_REQ REQ message to LMAC FW */
	return rw_msg_send(set_chnl_par, 1, MM_SET_CHANNEL_CFM, cfm);
}

int rw_msg_send_scan_cancel_req(void *cfm)
{
	struct scan_cancel_req *req;

	/* Build the SCAN_CANCEL_REQ message */
	req = ke_msg_alloc(SCAN_CANCEL_REQ, TASK_SCAN, TASK_API,
					   sizeof(struct scan_cancel_req));
	if (!req)
		return BK_ERR_NO_MEM;

	/* Send the SCAN_CANCEL_REQ message to LMAC FW */
	return rw_msg_send(req, 1, SCAN_CANCEL_CFM, cfm);
}

int rw_msg_send_sm_disconnect_req(DISCONNECT_PARAM_T *param)
{
	struct ke_msg cfm;
	struct sm_disconnect_req *req;
	int ret;

	/* Build the SM_DISCONNECT_REQ message */
	req = ke_msg_alloc(SM_DISCONNECT_REQ, TASK_SM, TASK_API,
					   sizeof(struct sm_disconnect_req));
	if (!req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the SM_DISCONNECT_REQ message */
	req->reason_code = param->reason_code;
	req->vif_idx = param->vif_idx;

	ret=rw_msg_send(req, 1, SM_DISCONNECT_CFM, &cfm);
	return ret;
}

int rw_msg_send_sm_connect_req(CONNECT_PARAM_T *sme, void *cfm)
{
	struct sm_connect_req *req;

	/* Build the SM_CONNECT_REQ message */
	req = ke_msg_alloc(SM_CONNECT_REQ, TASK_SM, TASK_API,
					   sizeof(struct sm_connect_req) + sme->bcn_len);
	if (!req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the SM_CONNECT_REQ message */
	req->ssid.length = sme->ssid.length;
	os_memcpy(req->ssid.array, sme->ssid.array, sme->ssid.length);
	os_memcpy(&req->bssid, &sme->bssid, sizeof(sme->bssid));

	req->vif_idx = sme->vif_idx;
	req->chan.band = sme->chan.band;
	req->chan.flags = sme->chan.flags;
	req->chan.freq = sme->chan.freq;
	req->chan.tx_power = sme->chan.tx_power;
	req->flags = sme->flags;
#if CONFIG_WAPI_SUPPORT
	req->ctrl_port_ethertype = PP_HTONS(sme->port_ethtype);
#else
	req->ctrl_port_ethertype = PP_HTONS(ETH_P_PAE);
#endif

	req->ie_len = sme->ie_len;
	req->auth_type = sme->auth_type;

	BK_ASSERT(req->ie_len < sizeof(req->ie_buf));

	os_memcpy((UINT8 *)req->ie_buf, (UINT8 *)sme->ie_buf, req->ie_len);

	req->bcn_len = sme->bcn_len;

	if (req->bcn_len)
		os_memcpy((UINT8 *)req->bcn_buf, (UINT8 *)sme->bcn_buf, req->bcn_len);

#if 1 /* auth/assoc LMAC command boundary probe; remove after comparison */
	{
		static uint32_t connect_cmd_seq;
		uint32_t n = connect_cmd_seq++;

		if (n < 16 || (n & 0x1f) == 0)
			RWNX_LOGW("lmac_connect_req seq=%u vif=%u band=%u freq=%u "
					  "txpwr=%u flags=%08x auth=%u ctrl=%04x ie_len=%u "
					  "bcn_len=%u bssid="MACSTR"\n",
					  n, req->vif_idx, req->chan.band, req->chan.freq,
					  req->chan.tx_power, (unsigned)req->flags,
					  req->auth_type, req->ctrl_port_ethertype,
					  req->ie_len, req->bcn_len,
					  MAC2STR((uint8_t *)(uintptr_t)req->bssid.array));
	}
#endif

#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
	rwnx_connecting_handler(req->vif_idx); // FIXME: move to right place
#endif

	/* Send the SM_CONNECT_REQ message to LMAC FW */
	{
		int ret = rw_msg_send(req, 1, SM_CONNECT_CFM, cfm);
#if 1
		if (cfm != NULL)
			RWNX_LOGW("lmac_connect_cfm ret=%d status=%u\n", ret,
					  ((struct sm_connect_cfm *)cfm)->status);
#endif
		return ret;
	}
}

#ifdef CONFIG_IEEE80211R
int rw_msg_update_ft_ies(UPDATE_FT_IES_PARAM_T *ft_ies)
{
	struct sm_connect_req *req;

	req = ke_msg_alloc(SM_FT_AUTH_RSP, TASK_SM, TASK_API, sizeof(struct sm_connect_req));
	if (!req)
		return BK_ERR_NO_MEM;

	req->ie_len = ft_ies->ft_ies_len;
	os_memcpy(req->ie_buf, ft_ies->ft_ies, ft_ies->ft_ies_len);

	return rw_msg_send(req, 0, 0, NULL);
}
#endif

#ifdef CONFIG_SAE_EXTERNAL
int rw_msg_send_sm_external_auth_status(EXTERNAL_AUTH_PARAM_T *auth_param)
{
	struct sm_external_auth_required_rsp *req;

	/* Build the SM_CONNECT_REQ message */
	req = ke_msg_alloc(SM_EXTERNAL_AUTH_REQUIRED_RSP, TASK_SM, TASK_API,
					   sizeof(struct sm_external_auth_required_rsp));
	if (!req)
		return BK_ERR_NO_MEM;

	req->vif_idx = auth_param->vif_idx;
	req->status = auth_param->status;

	/* Send the SM_CONNECT_REQ message to LMAC FW */
	return rw_msg_send(req, 0, 0/*DUMMY*/, NULL);
}
#endif

int rw_msg_send_arp_set_rate_req(uint8_t vif_idx, uint16_t arp_rate)
{
	struct mm_set_arp_tx_rate_req *req;

	/* Build the ARP TX RATE REQ message */
	req = ke_msg_alloc(MM_SET_ARP_TX_RATE_REQ, TASK_MM, TASK_API,
                       sizeof(struct mm_set_arp_tx_rate_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;
	req->arp_tx_rate = arp_rate;

	/* Send the ARP TX RATE REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_ARP_TX_RATE_CFM, NULL);
}

int rw_msg_send_listen_interval_req(uint8_t vif_idx, uint8_t interval)
{
	struct mm_set_listen_interval_req *req;
	/* Build the MM_BA_DEL_REQ message */
	req = ke_msg_alloc(MM_SET_LISTEN_INTERVAL_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_set_listen_interval_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;
	req->listen_interval = interval;

	/* Send the MM_BA_DEL_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_LISTEN_INTERVAL_CFM, NULL);
}

int rw_msg_get_listen_interval_req(void *cfm)
{
	struct mm_get_listen_interval_req *req = NULL;

	req = ke_msg_alloc(MM_GET_LISTEN_INTERVAL_REQ, TASK_MM, TASK_API,
					   sizeof(struct mm_get_listen_interval_req));

	if (!req)
		return BK_ERR_NO_MEM;

	return rw_msg_send(req, 1, MM_GET_LISTEN_INTERVAL_CFM, cfm);
}

