JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
int rw_msg_send_bcn_loss_int_req(uint8_t vif_idx, uint8_t interval,uint8_t repeat_num)
{
	struct mm_set_bcn_loss_int_req *req;
	/* Build the MM_BA_DEL_REQ message */
	req = ke_msg_alloc(MM_SET_BCN_LOSS_INT_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_set_bcn_loss_int_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;
	req->listen_interval = interval;
	req->repeat_num = repeat_num;

	/* Send the MM_BA_DEL_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_BCN_LOSS_INT_CFM, NULL);
}

int rw_msg_send_bcn_loss_time_req(uint8_t vif_idx, uint8_t wait_cnt,uint8_t wake_cnt)
{
	struct mm_set_bcn_loss_time_req *req;
	/* Build the MM_SET_BCN_LOSS_TIME_REQ message */
	req = ke_msg_alloc(MM_SET_BCN_LOSS_TIME_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_set_bcn_loss_time_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;
	req->wait_cnt = wait_cnt;
	req->wake_cnt = wake_cnt;

	/* Send the MM_SET_BCN_LOSS_TIME_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_BCN_LOSS_TIME_CFM, NULL);
}

int rw_msg_send_bcn_recv_win_req(uint8_t vif_idx, uint8_t default_win,uint8_t max_win, uint8_t step)
{
	struct mm_set_bcn_recv_win_req *req;
	/* Build the MM_SET_BCN_RECV_WIN_REQ message */
	req = ke_msg_alloc(MM_SET_BCN_RECV_WIN_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_set_bcn_recv_win_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;
	req->default_win= default_win;
	req->max_win = max_win;
	req->step = step;

	/* Send the MM_SET_BCN_RECV_WIN_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_BCN_RECV_WIN_CFM, NULL);
}

int rw_msg_send_bcn_miss_time_req(uint8_t vif_idx, uint8_t bcnmiss_time)
{
	struct mm_set_bcn_miss_time_req *req;
	/* Build the MM_SET_BCN_LOSS_TIME_REQ message */
	req = ke_msg_alloc(MM_SET_BCN_MISS_TIME_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_set_bcn_miss_time_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;
	req->bcnmiss_time = bcnmiss_time;

	/* Send the MM_SET_BCN_LOSS_TIME_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_BCN_MISS_TIME_CFM, NULL);
}

int rw_msg_get_support_mode_req(uint8_t vif_idx, void *cfm)
{
	struct mm_get_support_mode_req *req;
	/* Build the MM_GET_SUPPORT_CAPA_MODE_REQ message */
	req = ke_msg_alloc(MM_GET_SUPPORT_CAPA_MODE_REQ, TASK_MM, TASK_API,
						sizeof(struct mm_get_support_mode_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_index = vif_idx;

	/* Send the MM_GET_SUPPORT_CAPA_MODE_CFM message to FW */
	return rw_msg_send(req, 1, MM_GET_SUPPORT_CAPA_MODE_CFM, cfm);
}

int rw_msg_send_psdebug_interval_req(uint8_t interval)
{
    struct mm_set_psdebug_interval_req *req;

    req = ke_msg_alloc(MM_SET_PSDEBUG_INTERVAL_REQ, TASK_MM, TASK_API,
                          sizeof(struct mm_set_psdebug_interval_req));
    if (!req)
        return -ENOMEM;

    /* Set parameters */
    req->psdebug_interval = interval;
    return rw_msg_send(req, 0, 0, NULL);
}

void rw_msg_send_psdebug_req(uint8_t index)
{
	extern void ps_set_debug_info(uint8_t index);
	ps_set_debug_info(index);
}

int rw_msg_send_td_interval_req(uint8_t interval, uint8_t max_pnk)
{
	extern void ps_set_td_info(uint8_t interval,uint8_t max_pnk);
	ps_set_td_info(interval,max_pnk);
	return 0;
}

int rw_msg_send_td_mask_req()
{
	extern void ps_mask_td_info();
	ps_mask_td_info();
	return 0;
}

int rw_msg_send_mm_mqtt_info(bool mqtt_connect, bool is_send_pingreq, uint32_t period_s)
{
	struct me_mqtt_keepalive_info_ind *ind;

	/* Build the ME_MQTT_KEEPALIVE_INFO_IND message */
	ind = ke_msg_alloc(ME_MQTT_KEEPALIVE_INFO_IND, TASK_ME, TASK_API,
					   sizeof(struct me_mqtt_keepalive_info_ind));
	if (!ind)
		return BK_ERR_NO_MEM;

	ind->mqtt_conn = mqtt_connect;
	ind->send_pingreq = is_send_pingreq;
	ind->period_s = period_s;

	/* Send the ME_MQTT_KEEPALIVE_INFO_IND message to LMAC FW */
	return rw_msg_send(ind, 0, 0, NULL);
}

int rw_msg_send_tim_update(u8 vif_idx, u16 aid, u8 tx_status)
{
	struct mm_tim_update_req *req;

	/* Build the MM_TIM_UPDATE_REQ message */
	req = ke_msg_alloc(MM_TIM_UPDATE_REQ, TASK_MM, TASK_API,
					   sizeof(struct mm_tim_update_req));
	if (!req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the MM_TIM_UPDATE_REQ message */
	req->aid = aid;
	req->tx_avail = tx_status;
	req->inst_nbr = vif_idx;

	/* Send the MM_TIM_UPDATE_REQ message to LMAC FW */
	return rw_msg_send(req, 0, MM_TIM_UPDATE_CFM, NULL);
}

int rw_msg_set_power(u8 vif_idx, u8 power)
{
	struct mm_set_power_req *req;

	/* Build the MM_SET_POWER_REQ message */
	req = ke_msg_alloc(MM_SET_POWER_REQ, TASK_MM, TASK_NONE,
					   sizeof(struct mm_set_power_req));
	if (!req)
		return BK_ERR_NO_MEM;

	/* Set parameters for the MM_SET_POWER_REQ message */
	req->inst_nbr = vif_idx;
	req->power = power;

	/* Send the MM_SET_POWER_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_SET_POWER_CFM, NULL);
}

#if CONFIG_P2P
int rw_msg_send_roc(u8 vif_index, unsigned int freq, uint32_t duration)
{
	struct mm_remain_on_channel_req *req;
	struct mm_remain_on_channel_cfm cfm;
	int ret;
	struct rwnx_hw *rwnx_hw = &g_rwnx_hw;
	struct rwnx_roc_elem *roc_elem;

	/* FIXME: LOCK */
    /* Check that no other RoC procedure has been launched */
	//RWNX_LOGD("req:%d %d %d\n", freq, duration, !!rwnx_hw->roc_elem);
	if (rwnx_hw->roc_elem) {
		return BK_ERR_BUSY;
	}

	roc_elem = os_zalloc(sizeof(struct rwnx_roc_elem));
	if (!roc_elem)
		return BK_ERR_NO_MEM;

	roc_elem->freq = freq;
	roc_elem->duration = duration;

	req = ke_msg_alloc(MM_REMAIN_ON_CHANNEL_REQ, TASK_MM, TASK_API,
					   sizeof(struct mm_remain_on_channel_req));
	if (!req) {
		os_free(roc_elem);
		return BK_ERR_NO_MEM;
	}

	req->op_code      = MM_ROC_OP_START;
	req->vif_index    = vif_index;

	if (freq >= 5925) {
		// FIXME: BK7239 6E
	} else if (freq >= 4900) {
		req->chan.band = PHY_BAND_5G;
	} else {
		req->chan.band = PHY_BAND_2G4;
	}
	req->chan.type = PHY_CHNL_BW_20;
	req->chan.prim20_freq = freq;
	req->chan.center1_freq = freq;
	req->duration_ms  = duration;

#if CONFIG_RWNX_SW_TXQ && CONFIG_P2P
	{
		void *vif = mac_vif_mgmt_get_entry(vif_index);

		if (vif)
			rwnx_txq_offchan_init(vif);
	}
#endif

	/* Send the MM_REMAIN_ON_CHANNEL_REQ message to LMAC FW */
	ret = rw_msg_send(req, 1, MM_REMAIN_ON_CHANNEL_CFM, &cfm);
	if (ret || cfm.status) {
#if CONFIG_RWNX_SW_TXQ && CONFIG_P2P
		{
			void *vif = mac_vif_mgmt_get_entry(vif_index);

			if (vif)
				rwnx_txq_offchan_deinit(vif);
		}
#endif
		os_free(roc_elem);
		return -1;
	} else {
		rwnx_hw->roc_elem = roc_elem;
	}

	return ret;
}

int rw_msg_send_cancel_roc(u8 vif_index)
{
	struct mm_remain_on_channel_req *req;
	struct rwnx_hw *rwnx_hw = &g_rwnx_hw;

	if (!rwnx_hw->roc_elem)
		return BK_ERR_PARAM;

	req = ke_msg_alloc(MM_REMAIN_ON_CHANNEL_REQ, TASK_MM, TASK_API,
					   sizeof(struct mm_remain_on_channel_req));
	if (!req)
		return BK_ERR_NO_MEM;

	req->vif_index = vif_index;
	req->op_code      = MM_ROC_OP_CANCEL;

	/* Send the MM_REMAIN_ON_CHANNEL_REQ message to LMAC FW */
	return rw_msg_send(req, 1, MM_REMAIN_ON_CHANNEL_CFM, NULL);
}

#endif // CONFIG_P2P

int rw_msg_send_arp_msg(u8 vif_idx)
{
	struct me_sta_arp_update_ind *ind;

	/* Build the ME_STA_ARP_UPDATE_IND message */
	ind = ke_msg_alloc(ME_STA_ARP_UPDATE_IND, TASK_ME, TASK_NONE,
					   sizeof(struct me_sta_arp_update_ind));
	if (!ind)
		return BK_ERR_NO_MEM;

	/* Set parameters for the ME_STA_ARP_UPDATE_IND message */
	ind->vif_idx = vif_idx;

	/* Send the ME_STA_ARP_UPDATE_IND message to LMAC FW */
	return rw_msg_send(ind, 0, 0, NULL);
}

#if CONFIG_WIFI_FTM
int rw_msg_send_ftm_start_req(uint8_t vif_idx, uint8_t ftm_per_burst, uint8_t nb_ftm_rsp, void *ind)
{
	struct ftm_start_req *req;
	/* Build the FTM_START_REQ message */
	req = ke_msg_alloc(FTM_START_REQ, TASK_FTM, TASK_API,
						  sizeof(struct ftm_start_req));
	if (!req)
		return -ENOMEM;

	/* Set parameters */
	req->vif_idx = vif_idx;
	req->ftm_per_burst = ftm_per_burst;
	req->nb_ftm_rsp = nb_ftm_rsp;

	/* Send the FTM_START_REQ message to LMAC FW */
	return rw_msg_send(req, 1, FTM_DONE_IND, ind);
}
#endif
#if CONFIG_WIFI_CSI_EN
int rw_msg_send_csi_alg_config_ind(uint16_t rate1,uint16_t rate2,uint16_t rate3,double thres1,double thres2)
{
	struct csi_alg_config *ind = ke_msg_alloc(CSI_ALG_CONFIG_IND, TASK_CSI, TASK_API,
						sizeof(struct csi_alg_config));
	if (!ind)
		return BK_ERR_NO_MEM;

	ind->csi_smooth_rate1 = rate1;
	ind->csi_smooth_rate2 = rate2;
	ind->csi_smooth_rate3 = rate3;
	ind->csi_thres1 = thres1;
	ind->csi_thres2 = thres2;

	return rw_msg_send(ind, 0, 0, NULL);
}

int rw_msg_send_csi_start_req(uint8_t work_type,uint8_t mode,uint8_t identity,uint8_t format,uint32_t interval,uint32_t delay,
					uint8_t tx_type,uint8_t rx_mode,uint8_t gap_num,uint32_t gap,uint32_t data_cnt,uint8_t filter_mac_num,uint8_t *mac)
{
	struct csi_start_req *req;

