JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_tx.c
	/* Build the SM_CONNECT_REQ message */
	req = ke_msg_alloc(CSI_START_REQ, TASK_CSI, TASK_API,
						sizeof(struct csi_start_req));
	if (!req)
		return BK_ERR_NO_MEM;

	req->csi_work_type = work_type;
	req->csi_work_mode = mode;
	req->csi_work_identity = identity;
	req->csi_work_format = format;
	req->csi_interval_time = interval;
	req->csi_delay_time = delay;
	req->csi_tx_type = tx_type;
	req->csi_rx_mode = rx_mode;
	req->csi_gap_num = gap_num;
	req->csi_gap_time = gap;
	req->csi_data_cnt = data_cnt;
	req->filter_mac_num = filter_mac_num;
	if(filter_mac_num > 0)
		os_memcpy(req->mac,mac,MAC_ADDR_LEN*4);

	/* Send the SM_CONNECT_REQ message to LMAC FW */
	return rw_msg_send(req, 1, CSI_START_CFM, NULL);
}
int rw_msg_send_csi_stop_req(uint8_t vif_idx)
{
	struct csi_stop_req *req;

	/* Build the SM_CONNECT_REQ message */
	req = ke_msg_alloc(CSI_STOP_REQ, TASK_CSI, TASK_API,
					   sizeof(struct csi_stop_req));
	if (!req)
		return BK_ERR_NO_MEM;

	req->vif_idx = vif_idx;

	/* Send the SM_CONNECT_REQ message to LMAC FW */
	return rw_msg_send(req, 1, CSI_STOP_CFM, NULL);
}

int rw_msg_send_csi_static_param_reset_req(uint8_t update_cali_mode,uint32_t cali_cnt)
{
    struct csi_static_reset_ind *req;

    /* Build the SM_CONNECT_REQ message */
    req = ke_msg_alloc(CSI_RESET_ALGO_STATIC_IND, TASK_CSI, TASK_API,
                       sizeof(struct csi_static_reset_ind));
    if (!req)
        return BK_ERR_NO_MEM;

    req->vif_idx = 0xff;
    req->cali_mode = update_cali_mode;
    req->cali_cnt = cali_cnt;

    /* Send the SM_CONNECT_REQ message to LMAC FW */
    return rw_msg_send(req, 0, 0, NULL);
}

#endif
